import random
from player import Player
from inventory import Inventory
from money import Money
from weapon import *




ASCII_ART = '''⣿⣯⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⣿⣿⣻⣿⣻⢕
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢕⢕
⣿⣿⣿⣽⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⣛⡛⠫⣻⡻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣯⣿⣏⢕
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣯⢵⠨⠂⠊⠀⠐⠸⡯⢽⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣹⢕
⣿⣿⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠗⡜⠠⡤⡀⠠⡤⠄⣇⣽⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣯⢕
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡐⢂⠀⣀⡃⢘⡀⠀⡇⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣯⡹⢕
⣿⣿⣽⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⢜⢌⡥⣛⣃⠮⣱⠍⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢕
⣿⣿⣻⣿⣿⣿⣿⣿⣿⣿⣿⠟⠛⠉⠱⡱⡓⣓⡔⡐⣈⢮⡣⠋⠙⠛⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣟⢕
⣿⣿⣹⣻⣿⣿⣿⣿⣿⣿⠁⠀⠀⠠⢠⠈⠋⠗⠷⠿⠺⠉⠀⠠⠀⠀⠈⣿⣿⣿⣿⣿⣿⣿⣿⣿⣾⣗⢕
⣿⣿⢻⣿⣿⣿⣿⣿⣿⡟⠀⢀⣀⣀⣹⡁⠀⠀⠀⠀⠀⠀⣀⡔⠉⠀⠀⣼⠿⣿⣿⣿⣿⣿⣿⣿⣿⠻⢕
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣧⡎⠁⠀⠀⠸⢛⠊⠉⠉⠀⠐⠒⠓⠓⣸⡀⡌⡀⢔⣼⣿⣿⣿⣿⣿⣿⣟⣕⢕
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⠀⠀⠀⢀⠀⠈⠙⠤⣤⣀⠀⠀⢧⢤⢤⣤⣈⣿⣿⣿⣿⣿⣿⣿⣿⣿⣻⢕
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣧⡀⣀⣰⣠⣀⣤⣶⣾⣿⡷⠓⠃⠀⠸⡁⠁⠛⣿⣿⣿⣿⣿⣿⣿⣿⣟⢕
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠻⣿⡿⠛⠛⠉⠁⠀⡸⠀⠀⠀⠀⠀⠀⠀⠀⠘⣿⣿⣿⣿⣿⣿⣿⣗⢕
⠉⠉⠉⠉⠉⠉⠭⠭⠉⠋⣫⢩⡉⠭⠭⠭⠭⢍⣉⣹⣡⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡏⠭⠭⠭⢭⡭⢷⢕
⠉⠙⠉⠙⠒⠘⠐⠂⠁⠁⠀⠀⠀⠀⠀⠈⠀⠀⣿⠀⠀⠹⣶⡆⣄⢀⠀⠄⠀⠠⠂⣿⠐⠐⠒⠒⠒⠀⢕
⠉⠙⠍⠉⠭⠉⠉⠭⠭⠭⠍⠩⠍⠭⠉⢉⡿⠏⠀⠀⠹⣷⣾⢚⣺⠤⠤⢧⢽⡿⠭⠍⠉⠭⠩⠩⢕⢕⢕
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠺⡂⠀⠀⠈⢿⣷⣵⣶⣶⣾⣿⣿⣿⣿⣿⣿⣿⣿⢕
⣟⠈⣟⠈⠀⠃⣿⢀⣟⢸⡇⠚⡈⢏⢸⠊⡘⢸⡧⢤⣴⠄⠀⠀⠀⠈⠉⠋⠁⠀⣿⠀⢏⠇⢽⡟⠅⡌⢕
⣿⠸⣿⠸⠀⢁⣿⠸⠈⣸⡇⠄⢑⠄⣽⠨⡀⠸⣇⣀⣿⡀⠀⠀⠀⠀⠀⠀⠀⢸⡏⠀⢈⠰⢸⡇⡁⢃⢕
⣿⠂⣿⠂⡁⢪⣿⢸⠐⣹⡷⡸⠈⠞⣿⢠⡅⡄⢩⢿⣿⣧⠆⠀⠀⠀⠀⡀⠀⠼⣧⣀⠃⠰⣹⡇⣇⠃⢕
⢛⣿⢛⣿⡟⠽⠿⢿⠛⣿⠻⢿⠻⠻⡻⣿⡿⠛⡛⡿⢿⣿⣟⢆⢁⡴⠁⠀⠀⠀⠉⣿⣿⣿⡿⠿⣿⠿⢕
⢿⠥⢿⠥⠴⠥⢬⠴⣾⢥⠤⢧⠥⡤⡭⣾⠱⠑⠀⠊⠂⠹⢿⣷⣾⢶⠀⡀⠊⠁⠀⠈⠻⣦⠽⣦⣆⣔⢕
⠄⠀⠄⠀⠄⠢⠀⣽⠃⠑⡁⠔⡂⠌⡒⡟⠛⡻⠛⡛⠛⡛⠿⣿⣿⣿⣓⠄⠀⠀⠀⠀⠀⠈⢷⣜⡳⣜⢕
⠆⢀⠆⢀⠈⠂⣱⢛⢟⠛⠛⢛⠛⡛⢻⣇⣌⣌⣔⣠⣑⣁⣡⣻⣿⣿⣿⣇⡀⠀⠀⠀⠀⠀⠀⠙⢯⠘⢕
⠴⡦⠴⡦⠥⣴⢣⠀⠄⠁⠉⠀⠢⡠⢸⠟⠉⠙⠙⠙⠩⠈⠐⠼⣿⣿⣿⣿⣷⡤⡂⠀⠀⠀⠀⠀⠀⠙⢕
⠈⣊⠈⣊⣲⢏⢀⠂⡢⠁⡨⠐⠀⠀⣿⠰⡂⠄⠒⠀⢔⢂⢍⠡⢿⣿⣿⣿⣿⣿⣗⡇⠀⠀⠀⠀⠀⠀'''

class Shop:
    def __init__(self, inventory, money):
        self.inventory = inventory
        self.money = money



    def visit(self, player):
        mn = player.gold
        while True:
            print(ASCII_ART)
            print("=== 상점 목록 ===")
            print("1. 랜덤 스탯 티켓 (10골드)")
            print("2. 마나물약 (3골드)")
            print("3. 회복약 (3골드)")
            print("4. 나가기")
            print("0. 강화")
            print(f'현재 소유중인 골드: {mn.gold}')
            try:
                choice = int(input("구매할 아이템 번호를 입력하세요: "))
                if choice == 1:
                    if mn.spend(10):
                        player.inventory.add_item("랜덤스탯티켓")
                elif choice == 2:
                    if mn.spend(20):
                        player.inventory.add_item("마나물약")
                elif choice == 3:
                    if mn.spend(3):
                        player.inventory.add_item("회복약")
                elif choice == 0:
                    try:
                        if mn.spend(20):
                            ps = player
                            pw = weapons[ps.weapon]
                            renforce(pw, ps)
                            ps.status_info()
                            time.sleep(3)
                    except:
                        print('무기가 없잖아? 자네 실수니 돈을 가져가겠네.. 흠흠..')
                        time.sleep(2)
                        continue
                elif choice == 4:
                    return
                else:
                    print("[ERROR] 몰록에서 골라!")
            except ValueError:
                print("[ERROR] 목록에서 고르라고!.")
